//ARIgguuE JOB (ACCT#),'ARIO6GU',MSGCLASS=H,CLASS=A,
//             REGION=4M,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,30)
//*
//* **************************************************************
//* *                                                            *
//* *                     ESTIAC INSTITUT                        *
//* *                                                            *
//* *           UNITE DE FORMATION COBOL PROGRAMMATION           *
//* *                                                            *
//* *   EXECUTION DU PROGRAMME ARIO6GU CORRESPONDANT AU TP N°6   *
//* *                                                            *
//* **************************************************************
//* **************************************************************
//* * PREMIERE ETAPE :                                           *
//* * EXECUTION DU PROGRAMME PRINCIPAL                           *
//* **************************************************************
//TP6     EXEC PGM=ARIO6GU
//* **************************************************************
//* * DECLARATION DE LA BIBLIOTHEQUE QUI CONTIENT LE LOAD MODULE *
//* **************************************************************
//STEPLIB  DD  DSN=ARISYS.ADREF.XV99R00.LOAD,DISP=SHR
//
