//ARI0409J JOB 'LOAD',CLASS=A,MSGCLASS=H,
//             NOTIFY=,REGION=4M,COND=(8,LT),
//             RESTART=*,TIME=(0,15)
//*===================================================================
//* LOAD
//*===================================================================
//LOAD     EXEC PGM=DSNUTILB,PARM='DB9G,,',COND=(8,LT)
//STEPLIB  DD DSN=DSN910.SDSNEXIT,DISP=SHR
//         DD DSN=DSN910.RUNLIB.LOAD,DISP=SHR
//         DD DSN=DSN910.SDSNLOAD,DISP=SHR
//SORTWK01 DD DSN=ARI04.ARI0409.SORTWK01,
//            DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SORTWK02 DD DSN=ARI04.ARI0409.SORTWK02,
//            DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SYSREC   DD DSN=ARI04.ARI0409.FVTE0009,DISP=SHR
//SYSDISC  DD DSN=ARI04.ARI0409.SYSDISC,DISP=(MOD,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SYSUT1   DD DSN=ARI04.ARI0409.SYSUT1,DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SORTOUT  DD DSN=ARI04.ARI0409.SORTOUT,DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SYSERR   DD DSN=ARI04.ARI0409.SYSERR,DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SYSMAP   DD DSN=ARI04.ARI0409.SYSMAP,DISP=(MOD,DELETE,CATLG),
//            SPACE=(16384,(20,20),,,ROUND),UNIT=3390
//SYSPRINT DD SYSOUT=*
//UTPRINT  DD SYSOUT=*
//SYSIN    DD *
LOAD DATA
   RESUME NO / RESUME NO REPLACE / RESUME YES
   ENFORCE CONSTRAINTS / ENFORCE NO
   INTO TABLE TXXXXXX
   WHEN (X:X) = 'X'
   ( XXXXXXXX POSITION(XXX) CHAR(XX)
   , XXXXXXXX POSITION(XXX) INTEGER EXTERNAL(10)
   , XXXXXXXX POSITION(XXX) DECIMAL EXTERNAL(XX)
   , XXXXXXXX POSITION(XXX) DATE EXTERNAL(10)    DEFAULTIF(XXX) = ' '
   , XXXXXXXX POSITION(XXX) TIME EXTERNAL(11)    DEFAULTIF(XXX) = ' ')
   INTO TABLE TXXXXXX
   WHEN (X:X) = 'X'
   ( XXXXXXXX POSITION(XXX) CHAR(XX)
   , XXXXXXXX POSITION(XXX) INTEGER EXTERNAL(10)
   , XXXXXXXX POSITION(XXX) DECIMAL EXTERNAL(XX)
   , XXXXXXXX POSITION(XXX) DATE EXTERNAL(10)    DEFAULTIF(XXX) = ' '
   , XXXXXXXX POSITION(XXX) TIME EXTERNAL(11)    DEFAULTIF(XXX) = ' ')
//
